///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// См. ЗащитаПерсональныхДанныхСлужебный.НомераКартинокСобытий152ФЗ
Функция НомераКартинокСобытий152ФЗ() Экспорт
	
	Возврат ЗащитаПерсональныхДанныхСлужебный.НомераКартинокСобытий152ФЗ();
	
КонецФункции

// См. ЗащитаПерсональныхДанныхСлужебный.ИменаИсточниковПерсональныхДанных
Функция ИменаИсточниковПерсональныхДанных() Экспорт
	
	Возврат ЗащитаПерсональныхДанныхСлужебный.ИменаИсточниковПерсональныхДанных();
	
КонецФункции

// См. ЗащитаПерсональныхДанныхСлужебный.ИменаРеквизитовИсточникаСодержащихСубъект
Функция ИменаРеквизитовИсточникаСодержащихСубъект(ИмяИсточника) Экспорт
	
	Возврат ЗащитаПерсональныхДанныхСлужебный.ИменаРеквизитовИсточникаСодержащихСубъект(ИмяИсточника);
	
КонецФункции

// См. ЗащитаПерсональныхДанныхСлужебный.КраткоеИмяПоля
Функция КраткоеИмяПоля(ПолноеИмяПоля, ПолноеИмяОбъекта) Экспорт
	
	Возврат ЗащитаПерсональныхДанныхСлужебный.КраткоеИмяПоля(ПолноеИмяПоля, ПолноеИмяОбъекта);
	
КонецФункции

// См. ЗащитаПерсональныхДанныхСлужебный.СведенияОПерсональныхДанных
Функция СведенияОПерсональныхДанных() Экспорт
	
	Возврат ЗащитаПерсональныхДанныхСлужебный.СведенияОПерсональныхДанных();
	
КонецФункции

// См. ЗащитаПерсональныхДанныхСлужебный.УничтожаемыеПерсональныеДанные
Функция УничтожаемыеПерсональныеДанные() Экспорт
	
	Возврат ЗащитаПерсональныхДанныхСлужебный.УничтожаемыеПерсональныеДанные();
	
КонецФункции

// См. ЗащитаПерсональныхДанныхСлужебный.КатегорииПерсональныхДанных
Функция КатегорииПерсональныхДанных() Экспорт
	
	Возврат ЗащитаПерсональныхДанныхСлужебный.КатегорииПерсональныхДанных();
	
КонецФункции

// см. ЗащитаПерсональныхДанныхСлужебный.КатегорииПерсональныхДанных
Функция МетаданныеПоТипамСубъекта() Экспорт
	
	Возврат ЗащитаПерсональныхДанныхСлужебный.МетаданныеПоТипамСубъекта();
	
КонецФункции

// см. ЗащитаПерсональныхДанныхСлужебный.ТипыСубъектов
Функция ТипыСубъектов() Экспорт
	
	Возврат ЗащитаПерсональныхДанныхСлужебный.ТипыСубъектов();
	
КонецФункции

// См. ЗащитаПерсональныхДанныхСлужебный.ТипыСубъектовДоступныхПоФункциональнымОпциям
Функция ТипыСубъектовДоступныхПоФункциональнымОпциям() Экспорт
	
	Возврат ЗащитаПерсональныхДанныхСлужебный.ТипыСубъектовДоступныхПоФункциональнымОпциям();
	
КонецФункции

// см. ЗащитаПерсональныхДанныхСлужебный.ИменаМетаданныхПоТипамСубъекта
Функция ИменаМетаданныхПоТипамСубъекта() Экспорт
	
	Возврат ЗащитаПерсональныхДанныхСлужебный.ИменаМетаданныхПоТипамСубъекта();
	
КонецФункции

// См. ЗащитаПерсональныхДанныхСлужебный.ПредставлениеКатегорииПерсональныхДанных
Функция ПредставлениеКатегорииПерсональныхДанных(ИмяКатегории) Экспорт

	Возврат ЗащитаПерсональныхДанныхСлужебный.ПредставлениеКатегорииПерсональныхДанных(ИмяКатегории);
	
КонецФункции

// См. ЗащитаПерсональныхДанныхСлужебный.СубъектДоступенПоФункциональнымОпциям
Функция СубъектДоступенПоФункциональнымОпциям(ИмяОбъекта) Экспорт

	Возврат ЗащитаПерсональныхДанныхСлужебный.СубъектДоступенПоФункциональнымОпциям(ИмяОбъекта);
	
КонецФункции

#КонецОбласти
